"""
    다음은 이젠IT아카데미 4강의실 1번부터 5번까지의 1분간 팔굽혀펴기 개수입니다.
    데이터는 리스트에 저장 되어 있습니다.
        result = [33, 40, 12, 63, 52]
    아래처럼 출력을 해 보시오

        1) 6번의 팔굽혀펴기 개수는 9개이다.
           리스트의 마지막에 추가하시오.
        2) 2번은 재측정하여 50개를 하였다.
        3) 3번부터 6번까지 데이터를 슬라이싱 하시오.
        4) 모든 데이터를 오름차순으로 정렬하시오.
"""

결과 = [33, 40, 12, 63, 52]

# 1) 6번의 팔굽혀펴기 개수는 9개이다.
결과.append(9)
print("1) ", 결과)
# 2) 2번은 재측정하여 50개를 하였다.
결과[1] = 50
print("2) ", 결과)
# 3) 3번부터 6번까지 데이터를 슬라이싱 하시오.
print("3) ", 결과[2:6])
# 4) 모든 데이터를 오름차순으로 정렬하시오.
결과.sort()
print("4) ", 결과)